chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/**
 * STM32H7S78-DK 電子相簿。
 *
 * 面板是 800x480 橫式，但照片是直式，所以整個 UI 跟照片都轉 90 度當成
 * 480x800 直立畫面用（gfx.c 負責座標轉換）。
 *
 * 流程：掛載 SD -> 掃描一次建立完整照片清單 -> 勾選最上層資料夾 -> 隨機播放。
 * 勾選只是過濾既有清單，不會重新掃卡。
 *
 * 整支程式對 SD 卡只讀不寫，磁碟層也回報寫入保護。
 */
#include "main.h"
#include "stm32h7s78_discovery.h"
#include "stm32h7s78_discovery_lcd.h"
#include "stm32h7s78_discovery_ts.h"
#include "stm32h7s78_discovery_sd.h"

#include "ff.h"
#include "ff_gen_drv.h"

#include "gfx.h"
#include "photo.h"

#include <string.h>
#include <stdbool.h>

extern const Diskio_drvTypeDef SD_BSP_Driver;

/* 1 = 開機解一張就停住，方便用 SWD 把緩衝區讀出來對照。 */
#define DEBUG_ONE_SHOT  0

#define FB0_ADDR        LCD_LAYER_0_ADDRESS      /* 0x90000000 */
#define FB1_ADDR        LCD_LAYER_1_ADDRESS      /* 0x90200000 */

#define COL_BG          RGB565(16, 18, 24)
#define COL_TEXT        RGB565(236, 238, 245)
#define COL_DIM         RGB565(140, 146, 160)
#define COL_ACCENT      RGB565(78, 154, 241)
#define COL_PANEL       RGB565(30, 34, 44)
#define COL_LINE        RGB565(54, 60, 74)

#define MAX_TOP         64U
#define MAX_PHOTOS      8192U
/* 完整路徑上限。中文/日文一個字 3 bytes，加上多層子資料夾很容易超過 128，
 * 超過的照片會被跳過。PSRAM 還有空間，放寬到 256 免得使用者莫名其妙少照片。 */
#define PATH_MAX        256U
#define NAME_MAX        96U
#define MAX_DEPTH       10U
#define SCAN_PATH_LEN   512U

/* 清單放 PSRAM：8192 x 256 = 2MB，內部 RAM 放不下。
 * 位置接在 photo.c 的縮圖緩衝區之後（見那邊的記憶體配置表）。 */
#define PLAYLIST_BASE   ((char *)0x91C00000u)     /* 8192 x 256 = 2 MB */
#define TOPIDX_BASE     ((uint8_t *)0x91E00000u)  /* 8 KB */

typedef struct {
    char     name[NAME_MAX];
    uint32_t photos;
    bool     selected;
} top_t;

static top_t    g_top[MAX_TOP];
static uint32_t g_top_count;
static uint32_t g_photo_count;

static uint16_t g_order[MAX_PHOTOS];
static uint32_t g_order_count;

static FATFS    g_fs;
static char     g_drive[4];
static DIR      g_dir[MAX_DEPTH];
static FILINFO  g_fno[MAX_DEPTH];
static char     g_scan_path[SCAN_PATH_LEN];
static uint32_t g_cur_top;

static uint32_t g_front;
static uint32_t g_interval_s = 3;      /* 預設 3 秒，可調 2~5 */

/* 診斷用，SWD 讀得到。 */
volatile uint32_t g_stage;
volatile int32_t  g_err;
volatile uint32_t g_decode_ok;
volatile uint32_t g_decode_fail;
volatile uint32_t g_last_ms;
volatile uint32_t g_exit_touch;   /* 因觸控離開播放的次數 */
volatile uint32_t g_skipped_long; /* 路徑太長被跳過的照片數 */
volatile uint32_t g_skipped_full; /* 清單滿了之後被跳過的照片數 */
volatile uint32_t g_paused;       /* 1 = 播放暫停中（畫面凍結）*/

/* ------------------------------------------------------------------ */
/* 基礎設施                                                            */
/* ------------------------------------------------------------------ */

/* PSRAM 設成 write-through：CPU 的寫入直接落到記憶體，LTDC 從 PSRAM 讀才不會
 * 讀到還留在快取裡的舊內容。整片 32MB 都設，因為解碼緩衝區也在這裡面。 */
static void psram_mpu_init(void)
{
    MPU_Region_InitTypeDef mpu = {0};

    HAL_MPU_Disable();
    mpu.Enable           = MPU_REGION_ENABLE;
    mpu.Number           = MPU_REGION_NUMBER7;
    mpu.BaseAddress      = 0x90000000u;
    mpu.Size             = MPU_REGION_SIZE_32MB;
    mpu.AccessPermission = MPU_REGION_FULL_ACCESS;
    mpu.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
    mpu.IsCacheable      = MPU_ACCESS_CACHEABLE;
    mpu.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;   /* write-through */
    mpu.TypeExtField     = MPU_TEX_LEVEL0;
    mpu.SubRegionDisable = 0x00;
    mpu.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
    HAL_MPU_ConfigRegion(&mpu);
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

    SCB_CleanInvalidateDCache();
}

static void screen_init(void)
{
    /* BSP 預設 ARGB8888（每像素 4 bytes），我們畫的是 16 位元，
     * 不指定 RGB565 的話會用錯的列距去讀，畫面會橫向重複。 */
    if (BSP_LCD_InitEx(0, LCD_ORIENTATION_LANDSCAPE, LCD_PIXEL_FORMAT_RGB565,
                       PHYS_W, PHYS_H) != BSP_ERROR_NONE) {
        Error_Handler();
    }

    for (uint32_t i = 0; i < (uint32_t)PHYS_W * PHYS_H; i++) {
        ((uint16_t *)FB0_ADDR)[i] = 0;
        ((uint16_t *)FB1_ADDR)[i] = 0;
    }

    BSP_LCD_SetLayerAddress(0, 0, FB0_ADDR);
    /* no-reload：位址只寫進 shadow register，等我們要求垂直消隱重載才生效。
     * 否則 SetLayerAddress 會在畫面掃描途中重寫整組暫存器而撕裂。 */
    BSP_LCD_Reload(0, BSP_LCD_RELOAD_NONE);
    BSP_LCD_DisplayOn(0);

    g_front = 0;
    gfx_set_framebuffer((uint16_t *)FB1_ADDR);
}

static void present(void)
{
    uint32_t drawn = g_front ? FB0_ADDR : FB1_ADDR;

    /* 只寫 CFBAR 一個暫存器：它是 shadow register，寫入不會立即生效，
     * 等垂直消隱重載時整批原子切換，中間沒有半完成狀態。 */
    LTDC_Layer1->CFBAR = drawn;
    LTDC->SRCR = LTDC_SRCR_VBR;
    for (uint32_t guard = 0; guard < 2000000u; guard++) {
        if ((LTDC->SRCR & LTDC_SRCR_VBR) == 0u) {
            break;
        }
    }

    g_front ^= 1u;
    gfx_set_framebuffer((uint16_t *)(g_front ? FB0_ADDR : FB1_ADDR));
}

static void rnd_mix(uint32_t v);      /* 定義在下面的亂數區塊 */
static void watchdog_feed(void);      /* 定義在下面的記憶卡狀態區塊 */
static bool sd_present(void);
static void show_scan_progress(void);

/* 觸控座標換成直立座標。
 * gfx 把邏輯 (x,y) 映到實體 offset (GFX_W-1-x)*PHYS_W + y，
 * 也就是實體列 = GFX_W-1-x、實體行 = y，反過來就是下面這樣。 */
static bool read_touch(int *x, int *y)
{
    TS_State_t st;

    if (BSP_TS_GetState(0, &st) != BSP_ERROR_NONE || !st.TouchDetected) {
        return false;
    }
    *x = (int)GFX_W - 1 - (int)st.TouchY;
    *y = (int)st.TouchX;

    /* 每一次觸控都是一次熵注入。 */
    rnd_mix(HAL_GetTick() + ((uint32_t)*x << 16) + (uint32_t)*y);
    return true;
}

/* 等到手指真的放開。
 *
 * 電容觸控在放開的瞬間會彈跳，讀到「沒碰到」不代表真的離開了。要連續數次
 * 都讀不到才算數，否則殘留的事件會被下一段程式碼當成新的觸碰 —— 進入播放
 * 後第一張照片立刻被判定成「使用者要離開」就是這樣來的。 */
static void wait_release(void)
{
    uint32_t t0 = HAL_GetTick();
    int clean = 0;
    int x, y;

    while (clean < 4) {
        watchdog_feed();
        if (read_touch(&x, &y)) {
            clean = 0;
            if (HAL_GetTick() - t0 > 3000u) {
                break;                  /* 觸控卡住就不要一直等 */
            }
        } else {
            clean++;
        }
        HAL_Delay(25);
    }
    HAL_Delay(120);
}

/* 偵測一次「確實的」觸碰：要連續讀到才算，避免雜訊誤觸發。 */
static bool touch_confirmed(void)
{
    int x, y;

    if (!read_touch(&x, &y)) {
        return false;
    }
    /* 原本要連續 4 次讀到才算數，短按很容易在中間被漏掉，變成「點不到」。
     * 兩次已經足以濾掉雜訊，反應也快得多。 */
    HAL_Delay(20);
    return read_touch(&x, &y);
}

