chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
static uint32_t rnd_state = 0x2545F491u;

/* 把外部熵混進種子。
 *
 * 原本只用「開機到掃描完的時間」當種子，但那段耗時相當固定（SD 初始化加上
 * 掃描固定數量的檔案），每次開機常常拿到同一個毫秒數 —— 同種子就是同一組
 * 順序，看起來就像沒有隨機。
 *
 * 使用者按下螢幕的時間點才是真正不可預測的：以毫秒計沒有人按得出重複，
 * 再加上 CPU 週期計數器（600MHz，同一毫秒內還有六十萬個刻度）與觸控座標，
 * 每一次觸碰都會讓後續的順序完全不同。 */
static void rnd_mix(uint32_t v)
{
    rnd_state ^= v * 2654435761u;
    rnd_state ^= DWT->CYCCNT;
    rnd_state = (rnd_state << 7) | (rnd_state >> 25);
    if (rnd_state == 0u) {
        rnd_state = 0x2545F491u;
    }
}

static uint32_t rnd(void)
{
    rnd_state ^= rnd_state << 13;
    rnd_state ^= rnd_state >> 17;
    rnd_state ^= rnd_state << 5;
    return rnd_state;
}

/* ------------------------------------------------------------------ */
/* 記憶卡狀態與看門狗                                                  */
/* ------------------------------------------------------------------ */

static IWDG_HandleTypeDef g_iwdg;
static bool g_wdt_on;

/* 獨立看門狗，用來兜住「卡片沒回應」這個沒辦法從程式裡跳出來的情況。
 *
 * BSP_SD_Init() 最終會走到 HAL 的 SD_InitCard()，裡面有
 *   while (sd_rca == 0U)
 * 這個迴圈沒有逾時保護。卡片若停在異常狀態不回應 CMD3，程式就永遠出不來，
 * 畫面停在「載入中」而且沒有任何提示 —— 使用者只會覺得機器壞了。
 *
 * 同一個執行緒沒辦法讓自己跳出無窮迴圈，只能靠硬體。逾時設 16 秒，正常
 * 操作（解一張照片約 0.5 秒、掃描一次約 1 秒）遠遠用不到。 */
static void watchdog_start(void)
{
    g_iwdg.Instance       = IWDG;
    g_iwdg.Init.Prescaler = IWDG_PRESCALER_256;   /* LSI 32kHz / 256 = 125Hz */
    g_iwdg.Init.Reload    = 2000u;                /* 2000 / 125 = 16 秒 */
    g_iwdg.Init.Window    = IWDG_WINDOW_DISABLE;
    if (HAL_IWDG_Init(&g_iwdg) == HAL_OK) {
        g_wdt_on = true;
    }
}

/* 所有可能久留的迴圈裡都要餵，否則會被誤判成當機而重置。 */
static void watchdog_feed(void)
{
    if (g_wdt_on) {
        (void)HAL_IWDG_Refresh(&g_iwdg);
    }
}

static bool sd_present(void)
{
    return BSP_SD_IsDetected(0) == SD_PRESENT;
}

/* ------------------------------------------------------------------ */
/* USER 按鈕：螢幕開關                                                 */
/* ------------------------------------------------------------------ */

static int32_t g_btn_idle;      /* 開機時的電位，當成「沒按」的基準 */
static int32_t g_btn_last;
static bool    g_screen_on = true;

/* 不假設按鈕是高電位還是低電位觸發，開機時量到什麼就當成放開的狀態，
 * 之後偏離這個值就是按下。這樣換板子或改接線都不用回來改程式。 */
static void button_init(void)
{
    (void)BSP_PB_Init(BUTTON_USER, BUTTON_MODE_GPIO);
    g_btn_idle = BSP_PB_GetState(BUTTON_USER);
    g_btn_last = g_btn_idle;
}

/* 偵測一次「按下」的邊緣。要連續兩次讀到同一個值才採信，濾掉接點彈跳。 */
static bool button_pressed(void)
{
    int32_t now = BSP_PB_GetState(BUTTON_USER);
    bool    edge;

    if (now != g_btn_last) {
        HAL_Delay(15);
        if (BSP_PB_GetState(BUTTON_USER) != now) {
            return false;               /* 彈跳，不算 */
        }
    }
    edge = (now != g_btn_idle) && (g_btn_last == g_btn_idle);
    g_btn_last = now;
    return edge;
}

/* 關螢幕時連播放一起暫停。
 *
 * 「螢幕關掉但背景繼續解碼」在這個專案裡沒有任何好處：順序是隨機的，使用者
 * 分不出「現在這張」和「暫停那張」的差別，卻要付出每 2~5 秒一次全速解碼的
 * 電力、以及整晚無意義的記憶卡讀取。背景運算要有價值，前提是背景有別的東西
 * 在跑（時鐘、網路同步之類），目前沒有。 */
static void screen_set(bool on)
{
    if (on == g_screen_on) {
        return;
    }
    g_screen_on = on;

    if (!on) {
        (void)BSP_LCD_DisplayOff(0);
        return;
    }

    (void)BSP_LCD_DisplayOn(0);

    /* BSP 的 DisplayOn 不會把背光打開，這是 ST 兩邊不對稱的地方：
     *
     *   DisplayOff  把背光腳（GPIOG15）從 LPTIM 的 PWM 替代功能改成一般
     *               輸出，而 ODR 是 0，等於把背光關掉
     *   DisplayOn   只做 __HAL_LTDC_ENABLE 和拉高 LCD_DISP_EN，
     *               完全沒碰背光腳
     *
     * 結果就是「關得掉、開不回來」：LTDC 恢復了、面板也 enable 了，就是沒有
     * 背光。這裡直接把那支腳拉高（全亮）。本專案不用亮度調節，所以維持一般
     * 輸出即可，不必還原成 PWM。 */
    {
        GPIO_InitTypeDef bl = {0};

        LCD_BL_CTRL_GPIO_CLK_ENABLE();
        bl.Mode  = GPIO_MODE_OUTPUT_PP;
        bl.Pull  = GPIO_NOPULL;
        bl.Speed = GPIO_SPEED_FREQ_MEDIUM;
        bl.Pin   = LCD_BL_CTRL_PIN;
        HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &bl);
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);
    }
}

/* 放在每個迴圈裡。回傳 true 代表螢幕是亮的（可以接受觸控）。 */
static bool screen_poll(void)
{
    if (button_pressed()) {
        screen_set(!g_screen_on);
    }
    return g_screen_on;
}

/* ------------------------------------------------------------------ */
/* 掃描                                                                */
/* ------------------------------------------------------------------ */

static bool is_jpeg(const char *name)
{
    size_t n = strlen(name);
    const char *p;

    if (n >= 4U) {
        p = name + n - 4;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'g') {
            return true;
        }
    }
    if (n >= 5U) {
        p = name + n - 5;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'e' && (p[4] | 32) == 'g') {
            return true;
        }
    }
    return false;
}

static void add_photo(const char *path, uint32_t top)
{
    char *slot;

    if (g_photo_count >= MAX_PHOTOS) {
        g_skipped_full++;
        return;
    }
    if (strlen(path) >= PATH_MAX) {
        g_skipped_long++;
        return;
    }
    slot = PLAYLIST_BASE + g_photo_count * PATH_MAX;
    strncpy(slot, path, PATH_MAX - 1U);
    slot[PATH_MAX - 1U] = 0;
    TOPIDX_BASE[g_photo_count] = (uint8_t)top;
    g_photo_count++;
}

/* DIR 與 FILINFO 依深度放 BSS：FILINFO 帶 UTF-8 長檔名緩衝區約 800 位元組，
 * 遞迴十層放堆疊會爆掉。 */
static void scan(uint32_t depth)
{
    size_t base = strlen(g_scan_path);

    if (depth >= MAX_DEPTH) {
        return;
    }
    if (f_opendir(&g_dir[depth], g_scan_path) != FR_OK) {
        return;
    }

    for (;;) {
        FILINFO *fi = &g_fno[depth];
        size_t len;

        if (f_readdir(&g_dir[depth], fi) != FR_OK || fi->fname[0] == 0) {
            break;
        }
        if (fi->fname[0] == '.' || (fi->fattrib & (AM_SYS | AM_HID))) {
            continue;
        }
        watchdog_feed();

        len = strlen(fi->fname);
        if (base + 1U + len + 1U > SCAN_PATH_LEN) {
            continue;
        }
        g_scan_path[base] = '/';
        memcpy(&g_scan_path[base + 1U], fi->fname, len + 1U);

        if (fi->fattrib & AM_DIR) {
            if (depth == 0U) {
                if (g_top_count >= MAX_TOP) {
                    g_scan_path[base] = 0;
                    continue;
                }
                g_cur_top = g_top_count;
                strncpy(g_top[g_cur_top].name, fi->fname, NAME_MAX - 1U);
                g_top[g_cur_top].name[NAME_MAX - 1U] = 0;
                g_top[g_cur_top].selected = true;   /* 預設全選 */
                g_top_count++;
            }
            scan(depth + 1U);
        } else if (is_jpeg(fi->fname) && depth > 0U && g_cur_top < MAX_TOP) {
            add_photo(g_scan_path, g_cur_top);
            g_top[g_cur_top].photos++;

            /* 掃幾萬個檔案要花上數十秒，畫面一直停在「載入中」會像當機。
             * 每 200 張更新一次數字，讓使用者看得到它在動。 */
            if ((g_photo_count % 200u) == 0u) {
                show_scan_progress();
            }
        }

        g_scan_path[base] = 0;
    }

    f_closedir(&g_dir[depth]);
    g_scan_path[base] = 0;
}

static uint32_t selected_photo_count(void)
{
    uint32_t n = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        uint32_t t = TOPIDX_BASE[i];
        if (t < g_top_count && g_top[t].selected) {
            n++;
        }
    }
    return n;
}

/* 依目前的勾選建立播放順序，然後洗牌。 */
static void build_order(void)
{
    g_order_count = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        uint32_t t = TOPIDX_BASE[i];
        if (t < g_top_count && g_top[t].selected) {
            g_order[g_order_count++] = (uint16_t)i;
        }
    }

    /* Fisher-Yates。每次進播放都重洗，播完一輪也重洗，
     * 所以同一批照片不會每輪都同一個順序。 */
    for (uint32_t i = g_order_count; i > 1U; i--) {
        uint32_t j = rnd() % i;
        uint16_t tmp = g_order[i - 1U];
        g_order[i - 1U] = g_order[j];
        g_order[j] = tmp;
    }
}

