chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* ------------------------------------------------------------------ */
/* 選擇畫面                                                            */
/* ------------------------------------------------------------------ */

#define ROW_Y0       120
#define ROW_H        58
#define ROWS_VISIBLE 7
#define BTN_ALL_Y    580
#define BTN_ALL_H    48
#define IV_Y         650
#define IV_H         48
#define IV_X0        110
#define IV_W         74
#define IV_GAP       10
#define BTN_GO_Y     720
#define BTN_GO_H     62

static uint32_t g_scroll;

static void draw_checkbox(int x, int y, bool on)
{
    gfx_rect(x, y, 32, 32, on ? COL_ACCENT : COL_LINE);
    gfx_rect(x + 1, y + 1, 30, 30, on ? COL_ACCENT : COL_LINE);
    if (on) {
        gfx_fill_rect(x + 8, y + 8, 16, 16, COL_ACCENT);
    }
}

/* 名稱太長就從尾端截掉，避免壓到右邊的張數。 */
static void draw_name_clipped(int x, int y, const char *s, int limit,
                              uint16_t color)
{
    char buf[NAME_MAX];

    strncpy(buf, s, NAME_MAX - 1U);
    buf[NAME_MAX - 1U] = 0;

    while (gfx_text_width(buf) > limit) {
        size_t len = strlen(buf);
        if (len == 0U) {
            break;
        }
        /* 往前退到不是 UTF-8 接續位元組的位置，才不會砍出半個字。 */
        do {
            len--;
        } while (len > 0U && ((buf[len] & 0xC0) == 0x80));
        buf[len] = 0;
    }
    gfx_text(x, y, buf, color);
}

static void draw_select_screen(void)
{
    uint32_t shown;

    gfx_clear(COL_BG);
    gfx_text_center(GFX_W / 2, 24, "電子相簿", COL_TEXT);
    gfx_text_center(GFX_W / 2, 62, "選擇要播放的資料夾", COL_DIM);

    shown = g_top_count - g_scroll;
    if (shown > ROWS_VISIBLE) {
        shown = ROWS_VISIBLE;
    }

    for (uint32_t i = 0; i < shown; i++) {
        uint32_t idx = g_scroll + i;
        int y = ROW_Y0 + (int)i * ROW_H;

        gfx_fill_rect(16, y, GFX_W - 32, ROW_H - 8, COL_PANEL);
        draw_checkbox(28, y + 9, g_top[idx].selected);
        draw_name_clipped(76, y + 15, g_top[idx].name,
                          GFX_W - 76 - 96, COL_TEXT);
        gfx_number_right(GFX_W - 28, y + 15, g_top[idx].photos, COL_DIM);
    }

    if (g_top_count > ROWS_VISIBLE) {
        gfx_text_center(GFX_W / 2, ROW_Y0 + ROWS_VISIBLE * ROW_H + 6,
                        "上下滑動看更多", COL_DIM);
    }

    gfx_pill(16, BTN_ALL_Y, GFX_W - 32, BTN_ALL_H, COL_PANEL);
    gfx_text_center(GFX_W / 2, BTN_ALL_Y + 14, "全部選取或取消", COL_TEXT);

    gfx_text(20, IV_Y + 14, "間隔", COL_DIM);
    for (uint32_t s = 2; s <= 5; s++) {
        int  x  = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
        bool on = (g_interval_s == s);
        gfx_pill(x, IV_Y, IV_W, IV_H, on ? COL_ACCENT : COL_PANEL);
        gfx_number(x + 20, IV_Y + 14, s, on ? COL_BG : COL_TEXT);
        gfx_text(x + 40, IV_Y + 14, "秒", on ? COL_BG : COL_TEXT);
    }

    {
        uint32_t n = selected_photo_count();
        gfx_pill(16, BTN_GO_Y, GFX_W - 32, BTN_GO_H,
                 n ? COL_ACCENT : COL_PANEL);
        if (n) {
            gfx_text_center(GFX_W / 2, BTN_GO_Y + 12, "開始播放", COL_BG);
            gfx_number_right(GFX_W - 40, BTN_GO_Y + 12, n, COL_BG);
        } else {
            gfx_text_center(GFX_W / 2, BTN_GO_Y + 20,
                            "沒有選取任何資料夾", COL_DIM);
        }
    }
}

/* 兩塊 buffer 都要畫，否則交換之後會看到上一次的內容。 */
static void repaint_select(void)
{
    for (int i = 0; i < 2; i++) {
        draw_select_screen();
        present();
    }
}

/* 回傳 true 表示要開始播放。 */
static bool select_screen(void)
{
    bool dirty = true;

    for (;;) {
        int x, y;

        if (dirty) {
            repaint_select();
            dirty = false;
        }

        watchdog_feed();
        if (!sd_present()) {
            return false;               /* 卡片被拔掉，交回上層處理 */
        }
        if (!screen_poll()) {
            /* 螢幕關著時不吃觸控，否則會在看不見的情況下改到設定。 */
            HAL_Delay(30);
            continue;
        }

        if (!read_touch(&x, &y)) {
            HAL_Delay(15);
            continue;
        }

        if (y >= ROW_Y0 && y < ROW_Y0 + ROWS_VISIBLE * ROW_H) {
            uint32_t i = g_scroll + (uint32_t)(y - ROW_Y0) / ROW_H;
            if (i < g_top_count) {
                g_top[i].selected = !g_top[i].selected;
                dirty = true;
            }
        } else if (y >= BTN_ALL_Y && y < BTN_ALL_Y + BTN_ALL_H) {
            bool any = false;
            for (uint32_t i = 0; i < g_top_count; i++) {
                if (g_top[i].selected) {
                    any = true;
                }
            }
            for (uint32_t i = 0; i < g_top_count; i++) {
                g_top[i].selected = !any;
            }
            dirty = true;
        } else if (y >= IV_Y && y < IV_Y + IV_H) {
            for (uint32_t s = 2; s <= 5; s++) {
                int bx = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
                if (x >= bx && x < bx + IV_W) {
                    g_interval_s = s;
                    dirty = true;
                }
            }
        } else if (y >= BTN_GO_Y && y < BTN_GO_Y + BTN_GO_H) {
            if (selected_photo_count() > 0U) {
                build_order();
                wait_release();
                return true;
            }
        }

        wait_release();
    }
}

/* ------------------------------------------------------------------ */
/* 播放                                                                */
/* ------------------------------------------------------------------ */

/* 掃描進度。數字會一直跳，讓使用者知道它在動而不是當掉了。 */
static void show_scan_progress(void)
{
    watchdog_feed();
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 60, "掃描記憶卡", COL_TEXT);
        gfx_number_right(GFX_W / 2 + 20, GFX_H / 2, g_photo_count, COL_ACCENT);
        gfx_text(GFX_W / 2 + 28, GFX_H / 2, "張", COL_DIM);
        present();
    }
}

static void show_message(const char *line1, const char *line2)
{
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 40, line1, COL_TEXT);
        if (line2) {
            gfx_text_center(GFX_W / 2, GFX_H / 2 + 10, line2, COL_DIM);
        }
        present();
    }
}

