chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* 螢幕關著時停在這裡。回傳 false 代表卡片被拔掉。 */
static bool wait_screen_on(void)
{
    while (!screen_poll()) {
        watchdog_feed();
        if (!sd_present()) {
            return false;
        }
        HAL_Delay(100);
    }
    return true;
}

/* 判斷觸控是短按還是長按。回傳 0=沒碰到，1=短按，2=長按。
 *
 * 短按暫停／繼續、長按回選單。原本短按就直接離開，結果想停下來看某一張時
 * 只能被踢回選單，反而看不到。 */
#define LONG_PRESS_MS   700u

static int touch_gesture(void)
{
    uint32_t t0;
    int x, y;

    if (!touch_confirmed()) {
        return 0;
    }
    t0 = HAL_GetTick();
    while (read_touch(&x, &y)) {
        watchdog_feed();
        if (HAL_GetTick() - t0 >= LONG_PRESS_MS) {
            wait_release();
            return 2;               /* 長按：回選單 */
        }
        HAL_Delay(20);
    }
    wait_release();
    return 1;                       /* 短按：暫停／繼續 */
}

/* 暫停時的操作列版面（直立座標）。 */
#define BAR_Y       660
#define BAR_H       120
#define BAR_MID     (GFX_W / 2)

/* 把一塊區域壓暗，做出半透明的感覺。
 *
 * RGB565 沒有 alpha 通道，所以是讀回原像素、把亮度減半再寫回去。照片內容
 * 還看得見，但按鈕的字浮得出來。 */
static void overlay_dim(int x, int y, int w, int h)
{
    for (int j = 0; j < h; j++) {
        for (int i = 0; i < w; i++) {
            uint16_t v = gfx_get_pixel(x + i, y + j);
            uint16_t r = (uint16_t)((v >> 11) & 0x1Fu) >> 1;
            uint16_t g = (uint16_t)((v >> 5) & 0x3Fu) >> 1;
            uint16_t b = (uint16_t)(v & 0x1Fu) >> 1;
            gfx_pixel(x + i, y + j, (uint16_t)((r << 11) | (g << 5) | b));
        }
    }
}

/* 在「正在顯示」的那塊 buffer 上直接畫操作列。
 *
 * 不能畫在 back buffer —— 那塊還沒輪到顯示，畫了看不見。present() 之後
 * gfx 指向的是 back buffer，所以要先把它切到 front，畫完再切回來。 */
static void draw_pause_bar(void)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);

    gfx_set_framebuffer(front);

    overlay_dim(0, BAR_Y, GFX_W, BAR_H);

    gfx_pill(16, BAR_Y + 24, BAR_MID - 32, BAR_H - 48, COL_ACCENT);
    gfx_text_center(16 + (BAR_MID - 32) / 2, BAR_Y + 44, "繼續播放", COL_BG);

    gfx_pill(BAR_MID + 16, BAR_Y + 24, BAR_MID - 32, BAR_H - 48, COL_PANEL);
    gfx_text_center(BAR_MID + 16 + (BAR_MID - 32) / 2, BAR_Y + 44,
                    "返回選單", COL_TEXT);

    gfx_set_framebuffer(back);
}

/* 暫停：畫面停在目前這張，直到再按一次。長按則回選單。
 * 回傳 true 表示要離開播放。 */
static bool paused_loop(void)
{
    g_paused = 1u;
    draw_pause_bar();

    for (;;) {
        int x, y;

        watchdog_feed();
        if (!sd_present()) {
            g_paused = 0u;
            return true;
        }
        if (!screen_poll()) {
            HAL_Delay(100);
            continue;
        }

        /* 座標要在「確認觸碰的當下」抓，不能確認完再讀一次 ——
         * 輕點的話那時手指已經放開，read_touch 撲空，按鈕就像沒反應。 */
        if (read_touch(&x, &y)) {
            int x2, y2;
            bool in_bar, go_menu;

            HAL_Delay(20);
            if (read_touch(&x2, &y2)) {   /* 第二次讀到就採信，並用新座標 */
                x = x2; y = y2;
            }
            in_bar  = (y >= BAR_Y && y < BAR_Y + BAR_H);
            go_menu = in_bar && (x >= BAR_MID);

            wait_release();
            g_paused = 0u;
            return go_menu;         /* 點右半＝回選單，其餘＝繼續播放 */
        }
        HAL_Delay(30);
    }
}

/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;
        int g;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            HAL_Delay(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        g = touch_gesture();
        if (g == 2) {
            g_exit_touch++;
            return 1;               /* 長按：回選單 */
        }
        if (g == 1) {
            if (paused_loop()) {    /* 短按：暫停，停在這張 */
                return 1;
            }
            last = HAL_GetTick();   /* 暫停的時間不算進展示時間 */
        }
        HAL_Delay(15);
    }
    return 0;
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos   = 0;
    bool     shown = false;

    /* 先確定手指已經離開「開始播放」那一下。 */
    wait_release();

    for (;;) {
        photo_result_t r;
        uint32_t t0;

        watchdog_feed();
        if (!sd_present() || !wait_screen_on()) {
            return;
        }

        /* 解下一張：畫進 back buffer，此時前一張還在螢幕上。 */
        t0 = HAL_GetTick();
        r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        if (r != PHOTO_OK) {
            r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        }
        g_last_ms = HAL_GetTick() - t0;

        if (r == PHOTO_OK) {
            g_decode_ok++;

            if (shown) {
                int w = wait_interval(g_last_ms);
                if (w != 0) {
                    return;             /* 觸控離開或卡片被拔掉 */
                }
            }
            present();
            shown = true;
        } else {
            /* 一張壞掉的照片不能讓相框停住，記錄之後直接換下一張。 */
            g_decode_fail++;
        }

        pos++;
        if (pos >= g_order_count) {
            build_order();              /* 播完一輪重新洗牌 */
            pos = 0;
        }
    }
}

/* ------------------------------------------------------------------ */

/* 掛載並掃描一次。回傳 false 代表這輪不能播（沒卡、掛不起來、沒照片）。 */
static bool mount_and_scan(void)
{
    g_top_count   = 0;
    g_photo_count = 0;
    g_order_count = 0;
    memset(g_top, 0, sizeof(g_top));

    g_stage = 31;
    g_err = (int32_t)f_mount(&g_fs, g_drive, 1);
    g_stage = 32;
    if (g_err != FR_OK) {
        show_message("記憶卡無法讀取", "請確認格式為 FAT32");
        return false;
    }

    g_stage = 4;
    strncpy(g_scan_path, g_drive, SCAN_PATH_LEN - 1U);
    g_scan_path[SCAN_PATH_LEN - 1U] = 0;
    {
        /* f_opendir 吃 "0:" 這種形式，結尾不要斜線。 */
        size_t n = strlen(g_scan_path);
        while (n > 0U && g_scan_path[n - 1U] == '/') {
            g_scan_path[--n] = 0;
        }
    }
    g_cur_top = MAX_TOP;
    scan(0);
    watchdog_feed();

    if (g_photo_count == 0U) {
        show_message("卡片裡沒有找到照片", "支援 jpg 與 jpeg");
        return false;
    }
    return true;
}

/* 卡片被拔掉之後的處理：卸載檔案系統，等使用者插回來。
 *
 * 一定要 f_mount(NULL) 卸載。FatFs 會把 FAT 表與目錄資訊快取在記憶體裡，
 * 換了一張卡還沿用舊快取，讀到的會是不存在的位置。 */
static void wait_for_card(void)
{
    f_mount(NULL, g_drive, 0);

    show_message("請插入記憶卡", "插入後會自動重新掃描");
    while (!sd_present()) {
        watchdog_feed();
        HAL_Delay(100);
    }

    /* 插入的瞬間接點會彈跳，等它穩定再動卡片，否則初始化容易失敗。 */
    for (int i = 0; i < 10; i++) {
        watchdog_feed();
        HAL_Delay(100);
    }
    show_message("讀取記憶卡", "載入中");
}

void album_run(void)
{
    TS_Init_t ts = { .Width = PHYS_W, .Height = PHYS_H,
                     .Orientation = TS_SWAP_NONE, .Accuracy = 2 };
    bool wdt_reset;

    g_stage = 1;

    /* 開啟週期計數器，rnd_mix() 拿它當高解析度的熵來源。 */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    /* 上一輪是被看門狗打掉的嗎？旗標要在這裡讀，之後會被清掉。 */
    wdt_reset = (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != 0u);
    __HAL_RCC_CLEAR_RESET_FLAGS();

    psram_mpu_init();
    screen_init();

