chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    if (BSP_TS_Init(0, &ts) != BSP_ERROR_NONE) {
        show_message("觸控初始化失敗", 0);
    }
    button_init();

    g_stage = 2;
    if (!photo_init()) {
        show_message("JPEG 解碼器初始化失敗", 0);
        for (;;) { }
    }

    /* 插卡偵測腳要自己先設定好。
     *
     * BSP_SD_IsDetected() 只是讀 GPIO，不會設定它 —— 真正設定的是
     * BSP_SD_Init()。但主迴圈在掛載之前就會用 sd_present() 判斷有沒有卡，
     * 那時這支腳還沒被初始化過，讀到的是未定義狀態。實測沒插卡卻被判成
     * 有卡，於是走進掛載流程，最後顯示「記憶卡無法讀取，請確認格式為
     * FAT32」—— 訊息完全誤導。 */
    SD_DETECT_GPIO_CLK_ENABLE();
    {
        GPIO_InitTypeDef det = {0};
        det.Pin   = SD_DETECT_PIN;
        det.Mode  = GPIO_MODE_INPUT;
        det.Pull  = GPIO_NOPULL;
        det.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(SD_DETECT_GPIO_PORT, &det);
        HAL_Delay(10);              /* 讓腳位穩定再開始判斷 */
    }

    g_stage = 30;
    if (FATFS_LinkDriver(&SD_BSP_Driver, g_drive) != 0) {
        show_message("磁碟介面初始化失敗", 0);
        for (;;) { }
    }

    /* 被看門狗打掉，代表上一輪卡在記憶卡初始化裡出不來。這種狀態只有把卡片
     * 真正斷電（拔出來）才能清掉，所以先擋住不要再去碰它，否則會一直重置。 */
    if (wdt_reset) {
        show_message("記憶卡沒有回應", "請拔出記憶卡再重新插入");
        while (sd_present()) {
            HAL_Delay(100);
        }
    }

    watchdog_start();

    g_stage = 3;
    show_message("讀取記憶卡", "載入中");

    for (;;) {
        watchdog_feed();

        if (!sd_present()) {
            wait_for_card();
            continue;
        }
        if (!mount_and_scan()) {
            /* 掛不起來或沒照片：等使用者換一張卡再試。 */
            while (sd_present()) {
                watchdog_feed();
                HAL_Delay(200);
            }
            continue;
        }

#if DEBUG_ONE_SHOT
        /* 除錯：連續解好幾張（重現播放時的雙緩衝交替），最後停在一張上不動，
         * 方便用 SWD 把畫面完整抓下來。只解一張重現不了跨照片的問題。 */
        g_stage = 9;
        build_order();
        for (uint32_t k = 0; k < 6u && k < g_order_count; k++) {
            watchdog_feed();
            if (photo_show(PLAYLIST_BASE + g_order[k] * PATH_MAX) == PHOTO_OK) {
                g_decode_ok++;
                present();
            } else {
                g_decode_fail++;
            }
            HAL_Delay(300);
        }
        g_stage = 10;
        for (;;) {
            watchdog_feed();
            BSP_LED_Toggle(LD1);
            HAL_Delay(500);
        }
#else
        g_stage = 5;
        while (sd_present()) {
            if (select_screen()) {
                slideshow();
            }
        }
#endif
        /* 跳出來代表卡片被拔掉了。 */
    }
}
